app/controllers/announcements_controller.rb

SELECT * FROM `announcements` ORDER BY created_at DESC
---
  def index
    @announcements = Announcement.all

SELECT * FROM `announcements` WHERE (`announcements`.`id` = 1)
---
  def show
    @announcement = Announcement.find extract_id(params[:id])

INSERT INTO `announcements` (`name`, `updated_at`, `title`, `content`, `created_at`) VALUES('Katy Krupnik', '2010-11-28 06:43:47', 'Testing', '<p>this is a test</p>', '2010-11-28 06:43:47')
---
  def create
    @announcement = Announcement.new(params[:announcement])

    respond_to do |format|
      if @announcement.save