app/controllers/comments_controller.rb

SELECT * FROM `comments`
---
  def index
    @comments = Comment.all

SELECT * FROM "comments" WHERE ("comments"."id" = 1)
---
  def show
    @comment = Comment.find(params[:id])

SELECT * FROM `announcements` WHERE (id = '1') LIMIT 1
SELECT * FROM `posts` WHERE (id = '1') LIMIT 1
INSERT INTO "comments" ("user", "updated_at", "title", "post_id", "content", "created_at") VALUES('Jame Krupnik', '2010-09-13 23:57:09', 'Awesome Blog', 1, 'Love the blog blah blah', '2010-09-13 23:57:09')
---
  def create
    @comment = Comment.new(params[:comment])

	print "hello"

	if @comment.post_id.nil?

	@redirect_value = Announcement.find(:first, :conditions => "id = '#{@comment.announcement_id}'")

	else

    @redirect_value = Post.find(:first, :conditions => "id = '#{@comment.post_id}'")

	end

    respond_to do |format|
      if @comment.save