app/controllers/login_controller.rb

SELECT * FROM `users` WHERE (user_name = 'kkrupnik' and password = 'panzer123') LIMIT 1
---
    def authenticate

      #Will create a new object of User, retrieve values from the form and store it variable @user.
      @user = User.new(params[:userform])

      #find records with username,password
      valid_user = User.find(:first,:conditions => ["user_name = ? and password = ?",@user.user_name, @user.password])