app/controllers/pages_controller.rb

  def index
    @pages = Page.all
---
SELECT * FROM `pages`

  def show
    @page = Page.find(params[:id])
---
SELECT * FROM `pages` WHERE (`pages`.`id` = 1)

  def edit
    @page = Page.find(params[:id])
---
SELECT * FROM `pages` WHERE (`pages`.`id` = 1)

  def create
    @page = Page.new(params[:page])

    respond_to do |format|
      if @page.save
---
INSERT INTO `pages` (`name`, `updated_at`, `title`, `area_four`, `area_two`, `area_three`, `content`, `area_one`, `created_at`) VALUES('home', '2010-12-04 06:47:52', '', '', '', '', 'Home Page Content', '', '2010-12-04 06:47:52')

  def update
    @page = Page.find(params[:id])

    respond_to do |format|
      if @page.update_attributes(params[:page])
---
SELECT * FROM `pages` WHERE (`pages`.`id` = 1)
UPDATE `pages` SET `title` = 'Home', `updated_at` = '2010-12-04 06:53:34' WHERE `id` = 1