app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT * FROM `posts` ORDER BY created_at DESC

  def show
    @post = Post.find extract_id(params[:id])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)

  def edit
    @post = Post.find extract_id(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 2)

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("name", "updated_at", "title", "content", "created_at") VALUES('Katy Krupnik', '2010-11-20 14:02:18', 'Lingering coffee smell', '<p>As I sit down to write this I can still smell the coffee shop smell, and it just reminds me of how much I am loved and to let go and enjoy life. Today I was able to get together with a great friend who lives far away, and it was amazing to catch up with her and see where she is at. To get to have fellowship with such a close friend and to see that even though we haven&rsquo;t had a chance to talk in a long time we are still close, is just a great feeling. Not to mention she is tons of fun to be around, and a great shopping buddy (if this friend is reading this, thank you for all of the great finds!). Sometimes I forget how many great people I have in my life, and tonight was a great reminder of how many good people care about me and my family. God knows when I need a reminder, and I just feel so blessed to have a relationship with him, and with all of my friends and family.</p>

  def update
    @post = Post.find extract_id(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 2)
UPDATE "posts" SET "name" = 'Katherine Krupnik', "content" = 'I know its been forever since I have written, and you all have probably already crossed off this blog as just a whim for me but I am back (so don’t write this off as a whim just yet)!

  def destroy
    @post = Post.find extract_id(params[:id])
    @post.destroy
---
SELECT * FROM "posts" WHERE ("posts"."id" = 9)
DELETE FROM "posts" WHERE "id" = 9