app/controllers/users_controller.rb

INSERT INTO "users" ("updated_at", "first_name", "user_name", "password", "last_name", "created_at") VALUES('2010-09-19 20:13:11', 'firstname', 'username', 'password', 'lastname', '2010-09-19 20:13:11')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save